In [1]:
import pandas as pd
import numpy as np

In [2]:
months = ['Jan', 'Feb', 'Mar', 'Apr', 'May']
days = [31, 28, 31, 30, 31]

In [4]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [5]:
df['days'] = days
df['months'] = months

In [6]:
df

   days months
0    31    Jan
1    28    Feb
2    31    Mar
3    30    Apr
4    31    May

In [7]:
months1 = ['Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov']
days1 = [30, 31, 31, 30, 31, 30]

In [9]:
df1 = pd.DataFrame()
df1['days'] = days1
df1['months'] = months1
df1

   days months
0    30    Jun
1    31    Jul
2    31    Aug
3    30    Sep
4    31    Oct
5    30    Nov

concat 
join 
merge

In [12]:
df2 = pd.concat([df, df1], ignore_index=True)

In [13]:
df2

    days months
0     31    Jan
1     28    Feb
2     31    Mar
3     30    Apr
4     31    May
5     30    Jun
6     31    Jul
7     31    Aug
8     30    Sep
9     31    Oct
10    30    Nov

In [14]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

In [15]:
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [16]:
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})
other

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [18]:
df.join(other, lsuffix='l', rsuffix='r')

  keyl   A keyr    B
0   K0  A0   K0   B0
1   K1  A1   K1   B1
2   K2  A2   K2   B2
3   K3  A3  NaN  NaN
4   K4  A4  NaN  NaN
5   K5  A5  NaN  NaN